file mkdir sta_after_synthesis_intermediate/reports
set report_dir sta_after_synthesis_intermidiate/reports
read_lib slow.lib
read_verilog synthesised_netlist.v
set_top_module ticket_machine_fsm
read_sdc constraint.sdc
check_timing > $report_dir/check_timing_intermediate.rpt
report_timing > $report_dir/timing_report_intermediate.rpt
report_timing -retime path_slew_propagation -max_path 50 -nworst 50 -path_type full_clock > $report_dir/pba_intermediate.rpt
report_analysis_coverage > $report_dir/analysis_coverage_intermediate.rpt
report_analysis_summary > $report_dir/analysis_summary_intermediate.rpt
report_clocks > $report_dir/clocks_intermediate.rpt
report_case_analysis > $report_dir/case_analysis_intermediate.rpt
report_constraints -all_violators > $report_dir/allviolations_intermediate.rpt
