create_clock -name clk -period 4.22[get_ports "clk"]
set_clock_transition -rise 0.4 [get_clocks "clk"]
set_clock_transition -fall 0.4[get_clocks "clk"]

set_input_transition -rise 0.2 [all_inputs]
set_input_transition -fall 0.2 [all_inputs]
synthesize -effort high -directive AreaOptimizedHigh
set_load 0.5 [all_outputs]
set_input_delay -clock [get_clocks "clk"] 3 [all_inputs]
set_output_delay -clock [get_clocks "clk"] 3 [all_outputs]

