set_attr lib_search_path /home/abhinav24167/Desktop/TicketMachine/lib/90
set_attr hdl_search_path /home/abhinav24167/Desktop/TicketMachine/syn_report
set_attr library slow.lib
read_hdl synthesised_netlist.v
elaborate ticket_machine_fsm
read_sdc /home/abhishek23151/VDF_PROJECT/constraints/design.sdc
report timing -lint
set_attribute dft_scan_style muxed_scan
define_dft shift_enable -active high -create_port scan_en
define_dft test_clock clk
report dft_setup
check_dft_rules >dft_report/dft_rules_report
fix_dft_violations -test_control scan_en -async_set -async_reset -clock
synthesize -to_mapped
set_attribute dft_min_number_of_scan_chains 1 [find / -design *]
set_attribute dft_mix_clock_edges_in_scan_chains true [find / -design *]
connect_scan_chains -auto_create_chains -preview
connect_scan_chains -auto_create_chains
report qor
write_atpg -cadence > rtl_module_min_time_dft.atpg
write_atpg -stil > rtl_module_still_min_time_dft.atpg
write_scandef> dft_report/rtl_module_min_time_dft.def
write_sdf -timescale ns -nonegchecks -recrem split -edges check_edge > dft_report/delays_optimal_min_time_dft.sdf
write_hdl -mapped > dft_report/dft_syn_min_time_dft.v
write_sdc > dft_report/dft_constraints_for_physical_design_min_time_dft.sdc
write_script > dft_report/dft_script_min_time_dft_sdc.g
report gates > dft_report/gates_min_time_dft.rep
report dft_registers >dft_report/registers_min_time_dft.rep
report timing > dft_report/dft_timing_report_min_time_dft.rep
report power > dft_report/dft_timing_power_report_min_time_dft.rep
report area > dft_report/dft_timing_area_report_min_time_dft.rep
report summary > dft_report/summary_min_time_dft.rep
gui_show

