create_clock -name clk -period 4.22 [get_ports clk]
set_clock_transition -rise 0.1 [get_clocks clk]
set_clock_transition -fall 0.1 [get_clocks clk]
set_clock_uncertainty 0.1 [get_clocks clk]
set_input_delay -clock [get_clocks clk] 1.5 [all_inputs]
set_output_delay -clock [get_clocks clk] 0.05 [all_outputs]

